SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
/* Bit fields for RAC PATRIM2 */
#define _RAC_PATRIM2_RESETVALUE                                       0x00007777UL                                           /**< Default value for RAC_PATRIM2               */
#define _RAC_PATRIM2_MASK                                             0xFFFFFFFFUL                                           /**< Mask for RAC_PATRIM2                        */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_SHIFT                          0                                                      /**< Shift value for RAC_TXTRIMCLKGENDUTYN       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_MASK                           0xFUL                                                  /**< Bit mask for RAC_TXTRIMCLKGENDUTYN          */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_DEFAULT                        0x00000007UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0000ps               0x00000000UL                                           /**< Mode pc50_plus_0000ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_2p40ps               0x00000001UL                                           /**< Mode pc50_plus_2p40ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_5p00ps               0x00000002UL                                           /**< Mode pc50_plus_5p00ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_7p20ps               0x00000003UL                                           /**< Mode pc50_plus_7p20ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_10p8ps               0x00000004UL                                           /**< Mode pc50_plus_10p8ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_13p6ps               0x00000005UL                                           /**< Mode pc50_plus_13p6ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_17p1ps               0x00000006UL                                           /**< Mode pc50_plus_17p1ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_21p9ps               0x00000007UL                                           /**< Mode pc50_plus_21p9ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_28p1ps               0x00000008UL                                           /**< Mode pc50_plus_28p1ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_36p3ps               0x00000009UL                                           /**< Mode pc50_plus_36p3ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_47p3ps               0x0000000AUL                                           /**< Mode pc50_plus_47p3ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_62p0ps               0x0000000BUL                                           /**< Mode pc50_plus_62p0ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0110ps               0x0000000CUL                                           /**< Mode pc50_plus_0110ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0211ps               0x0000000DUL                                           /**< Mode pc50_plus_0211ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0304ps               0x0000000EUL                                           /**< Mode pc50_plus_0304ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0450ps               0x0000000FUL                                           /**< Mode pc50_plus_0450ps for RAC_PATRIM2       */
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_DEFAULT                         (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_DEFAULT << 0)          /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0000ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0000ps << 0) /**< Shifted mode pc50_plus_0000ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_2p40ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_2p40ps << 0) /**< Shifted mode pc50_plus_2p40ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_5p00ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_5p00ps << 0) /**< Shifted mode pc50_plus_5p00ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_7p20ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_7p20ps << 0) /**< Shifted mode pc50_plus_7p20ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_10p8ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_10p8ps << 0) /**< Shifted mode pc50_plus_10p8ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_13p6ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_13p6ps << 0) /**< Shifted mode pc50_plus_13p6ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_17p1ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_17p1ps << 0) /**< Shifted mode pc50_plus_17p1ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_21p9ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_21p9ps << 0) /**< Shifted mode pc50_plus_21p9ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_28p1ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_28p1ps << 0) /**< Shifted mode pc50_plus_28p1ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_36p3ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_36p3ps << 0) /**< Shifted mode pc50_plus_36p3ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_47p3ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_47p3ps << 0) /**< Shifted mode pc50_plus_47p3ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_62p0ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_62p0ps << 0) /**< Shifted mode pc50_plus_62p0ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0110ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0110ps << 0) /**< Shifted mode pc50_plus_0110ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0211ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0211ps << 0) /**< Shifted mode pc50_plus_0211ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0304ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0304ps << 0) /**< Shifted mode pc50_plus_0304ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0450ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYN_pc50_plus_0450ps << 0) /**< Shifted mode pc50_plus_0450ps for RAC_PATRIM2*/
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_SHIFT                          4                                                      /**< Shift value for RAC_TXTRIMCLKGENDUTYP       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_MASK                           0xF0UL                                                 /**< Bit mask for RAC_TXTRIMCLKGENDUTYP          */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_DEFAULT                        0x00000007UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0000ps               0x00000000UL                                           /**< Mode pc50_plus_0000ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_2p40ps               0x00000001UL                                           /**< Mode pc50_plus_2p40ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_5p00ps               0x00000002UL                                           /**< Mode pc50_plus_5p00ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_7p20ps               0x00000003UL                                           /**< Mode pc50_plus_7p20ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_10p8ps               0x00000004UL                                           /**< Mode pc50_plus_10p8ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_13p6ps               0x00000005UL                                           /**< Mode pc50_plus_13p6ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_17p1ps               0x00000006UL                                           /**< Mode pc50_plus_17p1ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_21p9ps               0x00000007UL                                           /**< Mode pc50_plus_21p9ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_28p1ps               0x00000008UL                                           /**< Mode pc50_plus_28p1ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_36p3ps               0x00000009UL                                           /**< Mode pc50_plus_36p3ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_47p3ps               0x0000000AUL                                           /**< Mode pc50_plus_47p3ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_62p0ps               0x0000000BUL                                           /**< Mode pc50_plus_62p0ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0110ps               0x0000000CUL                                           /**< Mode pc50_plus_0110ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0211ps               0x0000000DUL                                           /**< Mode pc50_plus_0211ps for RAC_PATRIM2       */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_304ps                0x0000000EUL                                           /**< Mode pc50_plus_304ps for RAC_PATRIM2        */
#define _RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_450ps                0x0000000FUL                                           /**< Mode pc50_plus_450ps for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_DEFAULT                         (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_DEFAULT << 4)          /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0000ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0000ps << 4) /**< Shifted mode pc50_plus_0000ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_2p40ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_2p40ps << 4) /**< Shifted mode pc50_plus_2p40ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_5p00ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_5p00ps << 4) /**< Shifted mode pc50_plus_5p00ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_7p20ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_7p20ps << 4) /**< Shifted mode pc50_plus_7p20ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_10p8ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_10p8ps << 4) /**< Shifted mode pc50_plus_10p8ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_13p6ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_13p6ps << 4) /**< Shifted mode pc50_plus_13p6ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_17p1ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_17p1ps << 4) /**< Shifted mode pc50_plus_17p1ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_21p9ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_21p9ps << 4) /**< Shifted mode pc50_plus_21p9ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_28p1ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_28p1ps << 4) /**< Shifted mode pc50_plus_28p1ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_36p3ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_36p3ps << 4) /**< Shifted mode pc50_plus_36p3ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_47p3ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_47p3ps << 4) /**< Shifted mode pc50_plus_47p3ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_62p0ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_62p0ps << 4) /**< Shifted mode pc50_plus_62p0ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0110ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0110ps << 4) /**< Shifted mode pc50_plus_0110ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0211ps                (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_0211ps << 4) /**< Shifted mode pc50_plus_0211ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_304ps                 (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_304ps << 4)  /**< Shifted mode pc50_plus_304ps for RAC_PATRIM2*/
#define RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_450ps                 (_RAC_PATRIM2_TXTRIMCLKGENDUTYP_pc50_plus_450ps << 4)  /**< Shifted mode pc50_plus_450ps for RAC_PATRIM2*/
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_SHIFT                        8                                                      /**< Shift value for RAC_TXTRIMCLKGENNOVFALL     */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_MASK                         0xF00UL                                                /**< Bit mask for RAC_TXTRIMCLKGENNOVFALL        */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_DEFAULT                      0x00000007UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0052ps                  0x00000000UL                                           /**< Mode tnov_0052ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0070ps                  0x00000001UL                                           /**< Mode tnov_0070ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0097ps                  0x00000002UL                                           /**< Mode tnov_0097ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0111ps                  0x00000003UL                                           /**< Mode tnov_0111ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0120ps                  0x00000004UL                                           /**< Mode tnov_0120ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0131ps                  0x00000005UL                                           /**< Mode tnov_0131ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0143ps                  0x00000006UL                                           /**< Mode tnov_0143ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0158ps                  0x00000007UL                                           /**< Mode tnov_0158ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0175ps                  0x00000008UL                                           /**< Mode tnov_0175ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0196ps                  0x00000009UL                                           /**< Mode tnov_0196ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0221ps                  0x0000000AUL                                           /**< Mode tnov_0221ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0251ps                  0x0000000BUL                                           /**< Mode tnov_0251ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0335ps                  0x0000000CUL                                           /**< Mode tnov_0335ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0466ps                  0x0000000DUL                                           /**< Mode tnov_0466ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0677ps                  0x0000000EUL                                           /**< Mode tnov_0677ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_1025ps                  0x0000000FUL                                           /**< Mode tnov_1025ps for RAC_PATRIM2            */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_DEFAULT                       (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_DEFAULT << 8)        /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0052ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0052ps << 8)    /**< Shifted mode tnov_0052ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0070ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0070ps << 8)    /**< Shifted mode tnov_0070ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0097ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0097ps << 8)    /**< Shifted mode tnov_0097ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0111ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0111ps << 8)    /**< Shifted mode tnov_0111ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0120ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0120ps << 8)    /**< Shifted mode tnov_0120ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0131ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0131ps << 8)    /**< Shifted mode tnov_0131ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0143ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0143ps << 8)    /**< Shifted mode tnov_0143ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0158ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0158ps << 8)    /**< Shifted mode tnov_0158ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0175ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0175ps << 8)    /**< Shifted mode tnov_0175ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0196ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0196ps << 8)    /**< Shifted mode tnov_0196ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0221ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0221ps << 8)    /**< Shifted mode tnov_0221ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0251ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0251ps << 8)    /**< Shifted mode tnov_0251ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0335ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0335ps << 8)    /**< Shifted mode tnov_0335ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0466ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0466ps << 8)    /**< Shifted mode tnov_0466ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0677ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_0677ps << 8)    /**< Shifted mode tnov_0677ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_1025ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVFALL_tnov_1025ps << 8)    /**< Shifted mode tnov_1025ps for RAC_PATRIM2    */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_SHIFT                        12                                                     /**< Shift value for RAC_TXTRIMCLKGENNOVRISE     */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_MASK                         0xF000UL                                               /**< Bit mask for RAC_TXTRIMCLKGENNOVRISE        */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_DEFAULT                      0x00000007UL                                           /**< Mode DEFAULT for RAC_PATRIM2                */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0053ps                  0x00000000UL                                           /**< Mode tnov_0053ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0073ps                  0x00000001UL                                           /**< Mode tnov_0073ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0102ps                  0x00000002UL                                           /**< Mode tnov_0102ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0116ps                  0x00000003UL                                           /**< Mode tnov_0116ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0125ps                  0x00000004UL                                           /**< Mode tnov_0125ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0136ps                  0x00000005UL                                           /**< Mode tnov_0136ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0149ps                  0x00000006UL                                           /**< Mode tnov_0149ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0164ps                  0x00000007UL                                           /**< Mode tnov_0164ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0181ps                  0x00000008UL                                           /**< Mode tnov_0181ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0203ps                  0x00000009UL                                           /**< Mode tnov_0203ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0230ps                  0x0000000AUL                                           /**< Mode tnov_0230ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0262ps                  0x0000000BUL                                           /**< Mode tnov_0262ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0353ps                  0x0000000CUL                                           /**< Mode tnov_0353ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0495ps                  0x0000000DUL                                           /**< Mode tnov_0495ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0723ps                  0x0000000EUL                                           /**< Mode tnov_0723ps for RAC_PATRIM2            */
#define _RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_1099ps                  0x0000000FUL                                           /**< Mode tnov_1099ps for RAC_PATRIM2            */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_DEFAULT                       (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_DEFAULT << 12)       /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0053ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0053ps << 12)   /**< Shifted mode tnov_0053ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0073ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0073ps << 12)   /**< Shifted mode tnov_0073ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0102ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0102ps << 12)   /**< Shifted mode tnov_0102ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0116ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0116ps << 12)   /**< Shifted mode tnov_0116ps for RAC_PATRIM2    */
#define RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0125ps                   (_RAC_PATRIM2_TXTRIMCLKGENNOVRISE_tnov_0125ps << 12)   /**< Shifted mode tnov_0125ps for RAC_PATRIM2    */
