SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0828ps                     0x0000000DUL                                           /**< Mode tedge_0828ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_1186ps                     0x0000000EUL                                           /**< Mode tedge_1186ps for RAC_PATRIM2           */
#define _RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_1793ps                     0x0000000FUL                                           /**< Mode tedge_1793ps for RAC_PATRIM2           */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_DEFAULT                           (_RAC_PATRIM2_TXTRIMDRVEDGEPP_DEFAULT << 28)           /**< Shifted mode DEFAULT for RAC_PATRIM2        */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0103ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0103ps << 28)      /**< Shifted mode tedge_0103ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0110ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0110ps << 28)      /**< Shifted mode tedge_0110ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0118ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0118ps << 28)      /**< Shifted mode tedge_0118ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0125ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0125ps << 28)      /**< Shifted mode tedge_0125ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0137ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0137ps << 28)      /**< Shifted mode tedge_0137ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0159ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0159ps << 28)      /**< Shifted mode tedge_0159ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0179ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0179ps << 28)      /**< Shifted mode tedge_0179ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0203ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0203ps << 28)      /**< Shifted mode tedge_0203ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0238ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0238ps << 28)      /**< Shifted mode tedge_0238ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0288ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0288ps << 28)      /**< Shifted mode tedge_0288ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0357ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0357ps << 28)      /**< Shifted mode tedge_0357ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0457ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0457ps << 28)      /**< Shifted mode tedge_0457ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0604ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0604ps << 28)      /**< Shifted mode tedge_0604ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0828ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_0828ps << 28)      /**< Shifted mode tedge_0828ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_1186ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_1186ps << 28)      /**< Shifted mode tedge_1186ps for RAC_PATRIM2   */
#define RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_1793ps                      (_RAC_PATRIM2_TXTRIMDRVEDGEPP_tedge_1793ps << 28)      /**< Shifted mode tedge_1793ps for RAC_PATRIM2   */

/* Bit fields for RAC PATRIM3 */
#define _RAC_PATRIM3_RESETVALUE                                       0x00910CAAUL                                                 /**< Default value for RAC_PATRIM3               */
#define _RAC_PATRIM3_MASK                                             0x1FFFFFFFUL                                                 /**< Mask for RAC_PATRIM3                        */
#define _RAC_PATRIM3_TXTRIMDREGBLEED_SHIFT                            0                                                            /**< Shift value for RAC_TXTRIMDREGBLEED         */
#define _RAC_PATRIM3_TXTRIMDREGBLEED_MASK                             0x3UL                                                        /**< Bit mask for RAC_TXTRIMDREGBLEED            */
#define _RAC_PATRIM3_TXTRIMDREGBLEED_DEFAULT                          0x00000002UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREGBLEED_bleed_0uA                        0x00000000UL                                                 /**< Mode bleed_0uA for RAC_PATRIM3              */
#define _RAC_PATRIM3_TXTRIMDREGBLEED_bleed_140uA                      0x00000001UL                                                 /**< Mode bleed_140uA for RAC_PATRIM3            */
#define _RAC_PATRIM3_TXTRIMDREGBLEED_bleed_280uA                      0x00000002UL                                                 /**< Mode bleed_280uA for RAC_PATRIM3            */
#define _RAC_PATRIM3_TXTRIMDREGBLEED_bleed_420uA                      0x00000003UL                                                 /**< Mode bleed_420uA for RAC_PATRIM3            */
#define RAC_PATRIM3_TXTRIMDREGBLEED_DEFAULT                           (_RAC_PATRIM3_TXTRIMDREGBLEED_DEFAULT << 0)                  /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGBLEED_bleed_0uA                         (_RAC_PATRIM3_TXTRIMDREGBLEED_bleed_0uA << 0)                /**< Shifted mode bleed_0uA for RAC_PATRIM3      */
#define RAC_PATRIM3_TXTRIMDREGBLEED_bleed_140uA                       (_RAC_PATRIM3_TXTRIMDREGBLEED_bleed_140uA << 0)              /**< Shifted mode bleed_140uA for RAC_PATRIM3    */
#define RAC_PATRIM3_TXTRIMDREGBLEED_bleed_280uA                       (_RAC_PATRIM3_TXTRIMDREGBLEED_bleed_280uA << 0)              /**< Shifted mode bleed_280uA for RAC_PATRIM3    */
#define RAC_PATRIM3_TXTRIMDREGBLEED_bleed_420uA                       (_RAC_PATRIM3_TXTRIMDREGBLEED_bleed_420uA << 0)              /**< Shifted mode bleed_420uA for RAC_PATRIM3    */
#define RAC_PATRIM3_TXTRIMDREGBLEEDAUTO                               (0x1UL << 2)                                                 /**< TXTRIMDREGBLEEDAUTO                         */
#define _RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_SHIFT                        2                                                            /**< Shift value for RAC_TXTRIMDREGBLEEDAUTO     */
#define _RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_MASK                         0x4UL                                                        /**< Bit mask for RAC_TXTRIMDREGBLEEDAUTO        */
#define _RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_DEFAULT                      0x00000000UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_disable                      0x00000000UL                                                 /**< Mode disable for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_enable                       0x00000001UL                                                 /**< Mode enable for RAC_PATRIM3                 */
#define RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_DEFAULT                       (_RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_DEFAULT << 2)              /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_disable                       (_RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_disable << 2)              /**< Shifted mode disable for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_enable                        (_RAC_PATRIM3_TXTRIMDREGBLEEDAUTO_enable << 2)               /**< Shifted mode enable for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGBLEEDAUTO                               (0x1UL << 3)                                                 /**< TXTRIMOREGBLEEDAUTO                         */
#define _RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_SHIFT                        3                                                            /**< Shift value for RAC_TXTRIMOREGBLEEDAUTO     */
#define _RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_MASK                         0x8UL                                                        /**< Bit mask for RAC_TXTRIMOREGBLEEDAUTO        */
#define _RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_DEFAULT                      0x00000001UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_disable_bleed_auto           0x00000000UL                                                 /**< Mode disable_bleed_auto for RAC_PATRIM3     */
#define _RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_enable_bleed_auto            0x00000001UL                                                 /**< Mode enable_bleed_auto for RAC_PATRIM3      */
#define RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_DEFAULT                       (_RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_DEFAULT << 3)              /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_disable_bleed_auto            (_RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_disable_bleed_auto << 3)   /**< Shifted mode disable_bleed_auto for RAC_PATRIM3*/
#define RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_enable_bleed_auto             (_RAC_PATRIM3_TXTRIMOREGBLEEDAUTO_enable_bleed_auto << 3)    /**< Shifted mode enable_bleed_auto for RAC_PATRIM3*/
#define _RAC_PATRIM3_TXTRIMDREGFB_SHIFT                               4                                                            /**< Shift value for RAC_TXTRIMDREGFB            */
#define _RAC_PATRIM3_TXTRIMDREGFB_MASK                                0x30UL                                                       /**< Bit mask for RAC_TXTRIMDREGFB               */
#define _RAC_PATRIM3_TXTRIMDREGFB_DEFAULT                             0x00000002UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREGFB_v1p222                              0x00000000UL                                                 /**< Mode v1p222 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREGFB_v1p276                              0x00000001UL                                                 /**< Mode v1p276 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREGFB_v1p346                              0x00000002UL                                                 /**< Mode v1p346 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREGFB_v1p436                              0x00000003UL                                                 /**< Mode v1p436 for RAC_PATRIM3                 */
#define RAC_PATRIM3_TXTRIMDREGFB_DEFAULT                              (_RAC_PATRIM3_TXTRIMDREGFB_DEFAULT << 4)                     /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREGFB_v1p222                               (_RAC_PATRIM3_TXTRIMDREGFB_v1p222 << 4)                      /**< Shifted mode v1p222 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREGFB_v1p276                               (_RAC_PATRIM3_TXTRIMDREGFB_v1p276 << 4)                      /**< Shifted mode v1p276 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREGFB_v1p346                               (_RAC_PATRIM3_TXTRIMDREGFB_v1p346 << 4)                      /**< Shifted mode v1p346 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREGFB_v1p436                               (_RAC_PATRIM3_TXTRIMDREGFB_v1p436 << 4)                      /**< Shifted mode v1p436 for RAC_PATRIM3         */
#define _RAC_PATRIM3_TXTRIMOREGFB_SHIFT                               6                                                            /**< Shift value for RAC_TXTRIMOREGFB            */
#define _RAC_PATRIM3_TXTRIMOREGFB_MASK                                0x3C0UL                                                      /**< Bit mask for RAC_TXTRIMOREGFB               */
#define _RAC_PATRIM3_TXTRIMOREGFB_DEFAULT                             0x00000002UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMOREGFB_v1p340                              0x00000000UL                                                 /**< Mode v1p340 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v1p491                              0x00000001UL                                                 /**< Mode v1p491 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v1p641                              0x00000002UL                                                 /**< Mode v1p641 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v1p791                              0x00000003UL                                                 /**< Mode v1p791 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v1p941                              0x00000004UL                                                 /**< Mode v1p941 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v2p091                              0x00000005UL                                                 /**< Mode v2p091 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v2p241                              0x00000006UL                                                 /**< Mode v2p241 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v2p391                              0x00000007UL                                                 /**< Mode v2p391 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v2p541                              0x00000008UL                                                 /**< Mode v2p541 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v2p691                              0x00000009UL                                                 /**< Mode v2p691 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v2p841                              0x0000000AUL                                                 /**< Mode v2p841 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v2p991                              0x0000000BUL                                                 /**< Mode v2p991 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREGFB_v3p141                              0x0000000CUL                                                 /**< Mode v3p141 for RAC_PATRIM3                 */
#define RAC_PATRIM3_TXTRIMOREGFB_DEFAULT                              (_RAC_PATRIM3_TXTRIMOREGFB_DEFAULT << 6)                     /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMOREGFB_v1p340                               (_RAC_PATRIM3_TXTRIMOREGFB_v1p340 << 6)                      /**< Shifted mode v1p340 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v1p491                               (_RAC_PATRIM3_TXTRIMOREGFB_v1p491 << 6)                      /**< Shifted mode v1p491 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v1p641                               (_RAC_PATRIM3_TXTRIMOREGFB_v1p641 << 6)                      /**< Shifted mode v1p641 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v1p791                               (_RAC_PATRIM3_TXTRIMOREGFB_v1p791 << 6)                      /**< Shifted mode v1p791 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v1p941                               (_RAC_PATRIM3_TXTRIMOREGFB_v1p941 << 6)                      /**< Shifted mode v1p941 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v2p091                               (_RAC_PATRIM3_TXTRIMOREGFB_v2p091 << 6)                      /**< Shifted mode v2p091 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v2p241                               (_RAC_PATRIM3_TXTRIMOREGFB_v2p241 << 6)                      /**< Shifted mode v2p241 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v2p391                               (_RAC_PATRIM3_TXTRIMOREGFB_v2p391 << 6)                      /**< Shifted mode v2p391 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v2p541                               (_RAC_PATRIM3_TXTRIMOREGFB_v2p541 << 6)                      /**< Shifted mode v2p541 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v2p691                               (_RAC_PATRIM3_TXTRIMOREGFB_v2p691 << 6)                      /**< Shifted mode v2p691 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v2p841                               (_RAC_PATRIM3_TXTRIMOREGFB_v2p841 << 6)                      /**< Shifted mode v2p841 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v2p991                               (_RAC_PATRIM3_TXTRIMOREGFB_v2p991 << 6)                      /**< Shifted mode v2p991 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMOREGFB_v3p141                               (_RAC_PATRIM3_TXTRIMOREGFB_v3p141 << 6)                      /**< Shifted mode v3p141 for RAC_PATRIM3         */
#define _RAC_PATRIM3_TXTRIMDREG_SHIFT                                 10                                                           /**< Shift value for RAC_TXTRIMDREG              */
#define _RAC_PATRIM3_TXTRIMDREG_MASK                                  0x1C00UL                                                     /**< Bit mask for RAC_TXTRIMDREG                 */
#define _RAC_PATRIM3_TXTRIMDREG_DEFAULT                               0x00000003UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMDREG_v1p212                                0x00000000UL                                                 /**< Mode v1p212 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREG_v1p257                                0x00000001UL                                                 /**< Mode v1p257 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREG_v1p301                                0x00000002UL                                                 /**< Mode v1p301 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREG_v1p346                                0x00000003UL                                                 /**< Mode v1p346 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREG_v1p391                                0x00000004UL                                                 /**< Mode v1p391 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREG_v1p436                                0x00000005UL                                                 /**< Mode v1p436 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREG_v1p481                                0x00000006UL                                                 /**< Mode v1p481 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMDREG_v1p526                                0x00000007UL                                                 /**< Mode v1p526 for RAC_PATRIM3                 */
#define RAC_PATRIM3_TXTRIMDREG_DEFAULT                                (_RAC_PATRIM3_TXTRIMDREG_DEFAULT << 10)                      /**< Shifted mode DEFAULT for RAC_PATRIM3        */
#define RAC_PATRIM3_TXTRIMDREG_v1p212                                 (_RAC_PATRIM3_TXTRIMDREG_v1p212 << 10)                       /**< Shifted mode v1p212 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREG_v1p257                                 (_RAC_PATRIM3_TXTRIMDREG_v1p257 << 10)                       /**< Shifted mode v1p257 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREG_v1p301                                 (_RAC_PATRIM3_TXTRIMDREG_v1p301 << 10)                       /**< Shifted mode v1p301 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREG_v1p346                                 (_RAC_PATRIM3_TXTRIMDREG_v1p346 << 10)                       /**< Shifted mode v1p346 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREG_v1p391                                 (_RAC_PATRIM3_TXTRIMDREG_v1p391 << 10)                       /**< Shifted mode v1p391 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREG_v1p436                                 (_RAC_PATRIM3_TXTRIMDREG_v1p436 << 10)                       /**< Shifted mode v1p436 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREG_v1p481                                 (_RAC_PATRIM3_TXTRIMDREG_v1p481 << 10)                       /**< Shifted mode v1p481 for RAC_PATRIM3         */
#define RAC_PATRIM3_TXTRIMDREG_v1p526                                 (_RAC_PATRIM3_TXTRIMDREG_v1p526 << 10)                       /**< Shifted mode v1p526 for RAC_PATRIM3         */
#define _RAC_PATRIM3_TXTRIMOREG_SHIFT                                 13                                                           /**< Shift value for RAC_TXTRIMOREG              */
#define _RAC_PATRIM3_TXTRIMOREG_MASK                                  0x1E000UL                                                    /**< Bit mask for RAC_TXTRIMOREG                 */
#define _RAC_PATRIM3_TXTRIMOREG_DEFAULT                               0x00000008UL                                                 /**< Mode DEFAULT for RAC_PATRIM3                */
#define _RAC_PATRIM3_TXTRIMOREG_v1p420                                0x00000000UL                                                 /**< Mode v1p420 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p448                                0x00000001UL                                                 /**< Mode v1p448 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p475                                0x00000002UL                                                 /**< Mode v1p475 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p503                                0x00000003UL                                                 /**< Mode v1p503 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p531                                0x00000004UL                                                 /**< Mode v1p531 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p558                                0x00000005UL                                                 /**< Mode v1p558 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p586                                0x00000006UL                                                 /**< Mode v1p586 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p613                                0x00000007UL                                                 /**< Mode v1p613 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p641                                0x00000008UL                                                 /**< Mode v1p641 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p668                                0x00000009UL                                                 /**< Mode v1p668 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p696                                0x0000000AUL                                                 /**< Mode v1p696 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p723                                0x0000000BUL                                                 /**< Mode v1p723 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p751                                0x0000000CUL                                                 /**< Mode v1p751 for RAC_PATRIM3                 */
#define _RAC_PATRIM3_TXTRIMOREG_v1p778                                0x0000000DUL                                                 /**< Mode v1p778 for RAC_PATRIM3                 */
