SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin05u                 0x00000002UL                                           /**< Mode imin05u for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin2p5u                0x00000003UL                                           /**< Mode imin2p5u for RAC_PATRIM4               */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_DEFAULT                  (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_DEFAULT << 13)  /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin20u                  (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin20u << 13)  /**< Shifted mode imin20u for RAC_PATRIM4        */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin10u                  (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin10u << 13)  /**< Shifted mode imin10u for RAC_PATRIM4        */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin05u                  (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin05u << 13)  /**< Shifted mode imin05u for RAC_PATRIM4        */
#define RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin2p5u                 (_RAC_PATRIM4_TXXPAVXSCURRENTCOARSEMIN_imin2p5u << 13) /**< Shifted mode imin2p5u for RAC_PATRIM4       */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_SHIFT                        15                                                     /**< Shift value for RAC_TXXPAVXSCURRENTFINE     */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_MASK                         0x78000UL                                              /**< Bit mask for RAC_TXXPAVXSCURRENTFINE        */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_DEFAULT                      0x00000008UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax200u                     0x00000000UL                                           /**< Mode imax200u for RAC_PATRIM4               */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax245u                     0x00000001UL                                           /**< Mode imax245u for RAC_PATRIM4               */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax293u                     0x00000002UL                                           /**< Mode imax293u for RAC_PATRIM4               */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax360u                     0x00000003UL                                           /**< Mode imax360u for RAC_PATRIM4               */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax400u                     0x00000004UL                                           /**< Mode imax400u for RAC_PATRIM4               */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax800u                     0x00000005UL                                           /**< Mode imax800u for RAC_PATRIM4               */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax1200u                    0x00000006UL                                           /**< Mode imax1200u for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax1600u                    0x00000007UL                                           /**< Mode imax1600u for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXXPAVXSCURRENTFINE_classd                       0x00000008UL                                           /**< Mode classd for RAC_PATRIM4                 */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_DEFAULT                       (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_DEFAULT << 15)       /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax200u                      (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax200u << 15)      /**< Shifted mode imax200u for RAC_PATRIM4       */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax245u                      (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax245u << 15)      /**< Shifted mode imax245u for RAC_PATRIM4       */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax293u                      (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax293u << 15)      /**< Shifted mode imax293u for RAC_PATRIM4       */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax360u                      (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax360u << 15)      /**< Shifted mode imax360u for RAC_PATRIM4       */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax400u                      (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax400u << 15)      /**< Shifted mode imax400u for RAC_PATRIM4       */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax800u                      (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax800u << 15)      /**< Shifted mode imax800u for RAC_PATRIM4       */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax1200u                     (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax1200u << 15)     /**< Shifted mode imax1200u for RAC_PATRIM4      */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax1600u                     (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_imax1600u << 15)     /**< Shifted mode imax1600u for RAC_PATRIM4      */
#define RAC_PATRIM4_TXXPAVXSCURRENTFINE_classd                        (_RAC_PATRIM4_TXXPAVXSCURRENTFINE_classd << 15)        /**< Shifted mode classd for RAC_PATRIM4         */
#define RAC_PATRIM4_TXXPAVXSCURRENTSELHPA                             (0x1UL << 19)                                          /**< TXXPAVXSCURRENTSELHPA                       */
#define _RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_SHIFT                      19                                                     /**< Shift value for RAC_TXXPAVXSCURRENTSELHPA   */
#define _RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_MASK                       0x80000UL                                              /**< Bit mask for RAC_TXXPAVXSCURRENTSELHPA      */
#define _RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_DEFAULT                    0x00000001UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_lpa                        0x00000000UL                                           /**< Mode lpa for RAC_PATRIM4                    */
#define _RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_hpa                        0x00000001UL                                           /**< Mode hpa for RAC_PATRIM4                    */
#define RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_DEFAULT                     (_RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_DEFAULT << 19)     /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_lpa                         (_RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_lpa << 19)         /**< Shifted mode lpa for RAC_PATRIM4            */
#define RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_hpa                         (_RAC_PATRIM4_TXXPAVXSCURRENTSELHPA_hpa << 19)         /**< Shifted mode hpa for RAC_PATRIM4            */
#define _RAC_PATRIM4_TXVXSCURRENTVREFN_SHIFT                          20                                                     /**< Shift value for RAC_TXVXSCURRENTVREFN       */
#define _RAC_PATRIM4_TXVXSCURRENTVREFN_MASK                           0x300000UL                                             /**< Bit mask for RAC_TXVXSCURRENTVREFN          */
#define _RAC_PATRIM4_TXVXSCURRENTVREFN_DEFAULT                        0x00000003UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXVXSCURRENTVREFN_ognd0p825                      0x00000000UL                                           /**< Mode ognd0p825 for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p075                      0x00000001UL                                           /**< Mode ognd1p075 for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p325                      0x00000002UL                                           /**< Mode ognd1p325 for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p575                      0x00000003UL                                           /**< Mode ognd1p575 for RAC_PATRIM4              */
#define RAC_PATRIM4_TXVXSCURRENTVREFN_DEFAULT                         (_RAC_PATRIM4_TXVXSCURRENTVREFN_DEFAULT << 20)         /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXVXSCURRENTVREFN_ognd0p825                       (_RAC_PATRIM4_TXVXSCURRENTVREFN_ognd0p825 << 20)       /**< Shifted mode ognd0p825 for RAC_PATRIM4      */
#define RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p075                       (_RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p075 << 20)       /**< Shifted mode ognd1p075 for RAC_PATRIM4      */
#define RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p325                       (_RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p325 << 20)       /**< Shifted mode ognd1p325 for RAC_PATRIM4      */
#define RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p575                       (_RAC_PATRIM4_TXVXSCURRENTVREFN_ognd1p575 << 20)       /**< Shifted mode ognd1p575 for RAC_PATRIM4      */
#define _RAC_PATRIM4_TXVXSCURRENTVREFP_SHIFT                          22                                                     /**< Shift value for RAC_TXVXSCURRENTVREFP       */
#define _RAC_PATRIM4_TXVXSCURRENTVREFP_MASK                           0xC00000UL                                             /**< Bit mask for RAC_TXVXSCURRENTVREFP          */
#define _RAC_PATRIM4_TXVXSCURRENTVREFP_DEFAULT                        0x00000003UL                                           /**< Mode DEFAULT for RAC_PATRIM4                */
#define _RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd0p825                      0x00000000UL                                           /**< Mode ovdd0p825 for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p075                      0x00000001UL                                           /**< Mode ovdd1p075 for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p325                      0x00000002UL                                           /**< Mode ovdd1p325 for RAC_PATRIM4              */
#define _RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p575                      0x00000003UL                                           /**< Mode ovdd1p575 for RAC_PATRIM4              */
#define RAC_PATRIM4_TXVXSCURRENTVREFP_DEFAULT                         (_RAC_PATRIM4_TXVXSCURRENTVREFP_DEFAULT << 22)         /**< Shifted mode DEFAULT for RAC_PATRIM4        */
#define RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd0p825                       (_RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd0p825 << 22)       /**< Shifted mode ovdd0p825 for RAC_PATRIM4      */
#define RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p075                       (_RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p075 << 22)       /**< Shifted mode ovdd1p075 for RAC_PATRIM4      */
#define RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p325                       (_RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p325 << 22)       /**< Shifted mode ovdd1p325 for RAC_PATRIM4      */
#define RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p575                       (_RAC_PATRIM4_TXVXSCURRENTVREFP_ovdd1p575 << 22)       /**< Shifted mode ovdd1p575 for RAC_PATRIM4      */

