SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
/* Bit fields for RAC TXPOWER */
#define _RAC_TXPOWER_RESETVALUE                                       0x007FE020UL                                /**< Default value for RAC_TXPOWER               */
#define _RAC_TXPOWER_MASK                                             0x007FEEFFUL                                /**< Mask for RAC_TXPOWER                        */
#define _RAC_TXPOWER_TXSTRIPE_SHIFT                                   0                                           /**< Shift value for RAC_TXSTRIPE                */
#define _RAC_TXPOWER_TXSTRIPE_MASK                                    0x1FUL                                      /**< Bit mask for RAC_TXSTRIPE                   */
#define _RAC_TXPOWER_TXSTRIPE_DEFAULT                                 0x00000000UL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define _RAC_TXPOWER_TXSTRIPE_on_stripe_0                             0x00000000UL                                /**< Mode on_stripe_0 for RAC_TXPOWER            */
#define _RAC_TXPOWER_TXSTRIPE_on_stripe_12                            0x0000000CUL                                /**< Mode on_stripe_12 for RAC_TXPOWER           */
#define RAC_TXPOWER_TXSTRIPE_DEFAULT                                  (_RAC_TXPOWER_TXSTRIPE_DEFAULT << 0)        /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define RAC_TXPOWER_TXSTRIPE_on_stripe_0                              (_RAC_TXPOWER_TXSTRIPE_on_stripe_0 << 0)    /**< Shifted mode on_stripe_0 for RAC_TXPOWER    */
#define RAC_TXPOWER_TXSTRIPE_on_stripe_12                             (_RAC_TXPOWER_TXSTRIPE_on_stripe_12 << 0)   /**< Shifted mode on_stripe_12 for RAC_TXPOWER   */
#define _RAC_TXPOWER_TXSLICE_SHIFT                                    5                                           /**< Shift value for RAC_TXSLICE                 */
#define _RAC_TXPOWER_TXSLICE_MASK                                     0xE0UL                                      /**< Bit mask for RAC_TXSLICE                    */
#define _RAC_TXPOWER_TXSLICE_DEFAULT                                  0x00000001UL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define _RAC_TXPOWER_TXSLICE_on_0_slice                               0x00000000UL                                /**< Mode on_0_slice for RAC_TXPOWER             */
#define _RAC_TXPOWER_TXSLICE_on_1_slices                              0x00000001UL                                /**< Mode on_1_slices for RAC_TXPOWER            */
#define _RAC_TXPOWER_TXSLICE_on_2_slices                              0x00000002UL                                /**< Mode on_2_slices for RAC_TXPOWER            */
#define _RAC_TXPOWER_TXSLICE_NA                                       0x00000003UL                                /**< Mode NA for RAC_TXPOWER                     */
#define RAC_TXPOWER_TXSLICE_DEFAULT                                   (_RAC_TXPOWER_TXSLICE_DEFAULT << 5)         /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define RAC_TXPOWER_TXSLICE_on_0_slice                                (_RAC_TXPOWER_TXSLICE_on_0_slice << 5)      /**< Shifted mode on_0_slice for RAC_TXPOWER     */
#define RAC_TXPOWER_TXSLICE_on_1_slices                               (_RAC_TXPOWER_TXSLICE_on_1_slices << 5)     /**< Shifted mode on_1_slices for RAC_TXPOWER    */
#define RAC_TXPOWER_TXSLICE_on_2_slices                               (_RAC_TXPOWER_TXSLICE_on_2_slices << 5)     /**< Shifted mode on_2_slices for RAC_TXPOWER    */
#define RAC_TXPOWER_TXSLICE_NA                                        (_RAC_TXPOWER_TXSLICE_NA << 5)              /**< Shifted mode NA for RAC_TXPOWER             */
#define _RAC_TXPOWER_TXDRVSLICE_SHIFT                                 9                                           /**< Shift value for RAC_TXDRVSLICE              */
#define _RAC_TXPOWER_TXDRVSLICE_MASK                                  0xE00UL                                     /**< Bit mask for RAC_TXDRVSLICE                 */
#define _RAC_TXPOWER_TXDRVSLICE_DEFAULT                               0x00000000UL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define RAC_TXPOWER_TXDRVSLICE_DEFAULT                                (_RAC_TXPOWER_TXDRVSLICE_DEFAULT << 9)      /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define _RAC_TXPOWER_TXANARAMPODEV_SHIFT                              13                                          /**< Shift value for RAC_TXANARAMPODEV           */
#define _RAC_TXPOWER_TXANARAMPODEV_MASK                               0x3E000UL                                   /**< Bit mask for RAC_TXANARAMPODEV              */
#define _RAC_TXPOWER_TXANARAMPODEV_DEFAULT                            0x0000001FUL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define RAC_TXPOWER_TXANARAMPODEV_DEFAULT                             (_RAC_TXPOWER_TXANARAMPODEV_DEFAULT << 13)  /**< Shifted mode DEFAULT for RAC_TXPOWER        */
#define _RAC_TXPOWER_TXANARAMPDRVFF_SHIFT                             18                                          /**< Shift value for RAC_TXANARAMPDRVFF          */
#define _RAC_TXPOWER_TXANARAMPDRVFF_MASK                              0x7C0000UL                                  /**< Bit mask for RAC_TXANARAMPDRVFF             */
#define _RAC_TXPOWER_TXANARAMPDRVFF_DEFAULT                           0x0000001FUL                                /**< Mode DEFAULT for RAC_TXPOWER                */
#define RAC_TXPOWER_TXANARAMPDRVFF_DEFAULT                            (_RAC_TXPOWER_TXANARAMPDRVFF_DEFAULT << 18) /**< Shifted mode DEFAULT for RAC_TXPOWER        */

/* Bit fields for RAC TXRAMP */
#define _RAC_TXRAMP_RESETVALUE                                        0x0000003FUL                                         /**< Default value for RAC_TXRAMP                */
#define _RAC_TXRAMP_MASK                                              0x000007FFUL                                         /**< Mask for RAC_TXRAMP                         */
#define _RAC_TXRAMP_TXANARAMPDRVBW_SHIFT                              0                                                    /**< Shift value for RAC_TXANARAMPDRVBW          */
#define _RAC_TXRAMP_TXANARAMPDRVBW_MASK                               0x3UL                                                /**< Bit mask for RAC_TXANARAMPDRVBW             */
#define _RAC_TXRAMP_TXANARAMPDRVBW_DEFAULT                            0x00000003UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_500k                   0x00000000UL                                         /**< Mode drv_ramp_bw_500k for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_1meg                   0x00000001UL                                         /**< Mode drv_ramp_bw_1meg for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_2meg                   0x00000002UL                                         /**< Mode drv_ramp_bw_2meg for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_4meg                   0x00000003UL                                         /**< Mode drv_ramp_bw_4meg for RAC_TXRAMP        */
#define RAC_TXRAMP_TXANARAMPDRVBW_DEFAULT                             (_RAC_TXRAMP_TXANARAMPDRVBW_DEFAULT << 0)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_500k                    (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_500k << 0)   /**< Shifted mode drv_ramp_bw_500k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_1meg                    (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_1meg << 0)   /**< Shifted mode drv_ramp_bw_1meg for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_2meg                    (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_2meg << 0)   /**< Shifted mode drv_ramp_bw_2meg for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_4meg                    (_RAC_TXRAMP_TXANARAMPDRVBW_drv_ramp_bw_4meg << 0)   /**< Shifted mode drv_ramp_bw_4meg for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVEN                                     (0x1UL << 2)                                         /**< TXANARAMPDRVEN                              */
#define _RAC_TXRAMP_TXANARAMPDRVEN_SHIFT                              2                                                    /**< Shift value for RAC_TXANARAMPDRVEN          */
#define _RAC_TXRAMP_TXANARAMPDRVEN_MASK                               0x4UL                                                /**< Bit mask for RAC_TXANARAMPDRVEN             */
#define _RAC_TXRAMP_TXANARAMPDRVEN_DEFAULT                            0x00000001UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPDRVEN_ana_ramp_drv_off                   0x00000000UL                                         /**< Mode ana_ramp_drv_off for RAC_TXRAMP        */
#define _RAC_TXRAMP_TXANARAMPDRVEN_tana_ramp_drv_on                   0x00000001UL                                         /**< Mode tana_ramp_drv_on for RAC_TXRAMP        */
#define RAC_TXRAMP_TXANARAMPDRVEN_DEFAULT                             (_RAC_TXRAMP_TXANARAMPDRVEN_DEFAULT << 2)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPDRVEN_ana_ramp_drv_off                    (_RAC_TXRAMP_TXANARAMPDRVEN_ana_ramp_drv_off << 2)   /**< Shifted mode ana_ramp_drv_off for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPDRVEN_tana_ramp_drv_on                    (_RAC_TXRAMP_TXANARAMPDRVEN_tana_ramp_drv_on << 2)   /**< Shifted mode tana_ramp_drv_on for RAC_TXRAMP*/
#define _RAC_TXRAMP_TXANARAMPODEVBW_SHIFT                             3                                                    /**< Shift value for RAC_TXANARAMPODEVBW         */
#define _RAC_TXRAMP_TXANARAMPODEVBW_MASK                              0x18UL                                               /**< Bit mask for RAC_TXANARAMPODEVBW            */
#define _RAC_TXRAMP_TXANARAMPODEVBW_DEFAULT                           0x00000003UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res105k                 0x00000000UL                                         /**< Mode odev_ramp_res105k for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res035k                 0x00000001UL                                         /**< Mode odev_ramp_res035k for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res015k                 0x00000002UL                                         /**< Mode odev_ramp_res015k for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res005k                 0x00000003UL                                         /**< Mode odev_ramp_res005k for RAC_TXRAMP       */
#define RAC_TXRAMP_TXANARAMPODEVBW_DEFAULT                            (_RAC_TXRAMP_TXANARAMPODEVBW_DEFAULT << 3)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res105k                  (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res105k << 3) /**< Shifted mode odev_ramp_res105k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res035k                  (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res035k << 3) /**< Shifted mode odev_ramp_res035k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res015k                  (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res015k << 3) /**< Shifted mode odev_ramp_res015k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res005k                  (_RAC_TXRAMP_TXANARAMPODEVBW_odev_ramp_res005k << 3) /**< Shifted mode odev_ramp_res005k for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVEN                                    (0x1UL << 5)                                         /**< TXANARAMPODEVEN                             */
#define _RAC_TXRAMP_TXANARAMPODEVEN_SHIFT                             5                                                    /**< Shift value for RAC_TXANARAMPODEVEN         */
#define _RAC_TXRAMP_TXANARAMPODEVEN_MASK                              0x20UL                                               /**< Bit mask for RAC_TXANARAMPODEVEN            */
#define _RAC_TXRAMP_TXANARAMPODEVEN_DEFAULT                           0x00000001UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_off                 0x00000000UL                                         /**< Mode ana_ramp_odev_off for RAC_TXRAMP       */
#define _RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_on                  0x00000001UL                                         /**< Mode ana_ramp_odev_on for RAC_TXRAMP        */
#define RAC_TXRAMP_TXANARAMPODEVEN_DEFAULT                            (_RAC_TXRAMP_TXANARAMPODEVEN_DEFAULT << 5)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_off                  (_RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_off << 5) /**< Shifted mode ana_ramp_odev_off for RAC_TXRAMP*/
#define RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_on                   (_RAC_TXRAMP_TXANARAMPODEVEN_ana_ramp_odev_on << 5)  /**< Shifted mode ana_ramp_odev_on for RAC_TXRAMP*/
#define RAC_TXRAMP_TXBYPASSRAMPCLK                                    (0x1UL << 6)                                         /**< TXBYPASSRAMPCLK                             */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_SHIFT                             6                                                    /**< Shift value for RAC_TXBYPASSRAMPCLK         */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_MASK                              0x40UL                                               /**< Bit mask for RAC_TXBYPASSRAMPCLK            */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_DEFAULT                           0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_use_ramp_clk                      0x00000000UL                                         /**< Mode use_ramp_clk for RAC_TXRAMP            */
#define _RAC_TXRAMP_TXBYPASSRAMPCLK_bypass_ramp_clk                   0x00000001UL                                         /**< Mode bypass_ramp_clk for RAC_TXRAMP         */
#define RAC_TXRAMP_TXBYPASSRAMPCLK_DEFAULT                            (_RAC_TXRAMP_TXBYPASSRAMPCLK_DEFAULT << 6)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXBYPASSRAMPCLK_use_ramp_clk                       (_RAC_TXRAMP_TXBYPASSRAMPCLK_use_ramp_clk << 6)      /**< Shifted mode use_ramp_clk for RAC_TXRAMP    */
#define RAC_TXRAMP_TXBYPASSRAMPCLK_bypass_ramp_clk                    (_RAC_TXRAMP_TXBYPASSRAMPCLK_bypass_ramp_clk << 6)   /**< Shifted mode bypass_ramp_clk for RAC_TXRAMP */
#define RAC_TXRAMP_TXMODEPHASEFLIP                                    (0x1UL << 7)                                         /**< TXMODEPHASEFLIP                             */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_SHIFT                             7                                                    /**< Shift value for RAC_TXMODEPHASEFLIP         */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_MASK                              0x80UL                                               /**< Bit mask for RAC_TXMODEPHASEFLIP            */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_DEFAULT                           0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_disable                           0x00000000UL                                         /**< Mode disable for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXMODEPHASEFLIP_enable                            0x00000001UL                                         /**< Mode enable for RAC_TXRAMP                  */
#define RAC_TXRAMP_TXMODEPHASEFLIP_DEFAULT                            (_RAC_TXRAMP_TXMODEPHASEFLIP_DEFAULT << 7)           /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXMODEPHASEFLIP_disable                            (_RAC_TXRAMP_TXMODEPHASEFLIP_disable << 7)           /**< Shifted mode disable for RAC_TXRAMP         */
#define RAC_TXRAMP_TXMODEPHASEFLIP_enable                             (_RAC_TXRAMP_TXMODEPHASEFLIP_enable << 7)            /**< Shifted mode enable for RAC_TXRAMP          */
#define RAC_TXRAMP_TXPHASEDIGITAL                                     (0x1UL << 8)                                         /**< TXPHASEDIGITAL                              */
#define _RAC_TXRAMP_TXPHASEDIGITAL_SHIFT                              8                                                    /**< Shift value for RAC_TXPHASEDIGITAL          */
#define _RAC_TXRAMP_TXPHASEDIGITAL_MASK                               0x100UL                                              /**< Bit mask for RAC_TXPHASEDIGITAL             */
#define _RAC_TXRAMP_TXPHASEDIGITAL_DEFAULT                            0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXPHASEDIGITAL_phase0                             0x00000000UL                                         /**< Mode phase0 for RAC_TXRAMP                  */
#define _RAC_TXRAMP_TXPHASEDIGITAL_phase180                           0x00000001UL                                         /**< Mode phase180 for RAC_TXRAMP                */
#define RAC_TXRAMP_TXPHASEDIGITAL_DEFAULT                             (_RAC_TXRAMP_TXPHASEDIGITAL_DEFAULT << 8)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXPHASEDIGITAL_phase0                              (_RAC_TXRAMP_TXPHASEDIGITAL_phase0 << 8)             /**< Shifted mode phase0 for RAC_TXRAMP          */
#define RAC_TXRAMP_TXPHASEDIGITAL_phase180                            (_RAC_TXRAMP_TXPHASEDIGITAL_phase180 << 8)           /**< Shifted mode phase180 for RAC_TXRAMP        */
#define RAC_TXRAMP_TXRESETPAPOWER                                     (0x1UL << 9)                                         /**< TXRESETPAPOWER                              */
#define _RAC_TXRAMP_TXRESETPAPOWER_SHIFT                              9                                                    /**< Shift value for RAC_TXRESETPAPOWER          */
#define _RAC_TXRAMP_TXRESETPAPOWER_MASK                               0x200UL                                              /**< Bit mask for RAC_TXRESETPAPOWER             */
#define _RAC_TXRAMP_TXRESETPAPOWER_DEFAULT                            0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXRESETPAPOWER_no_reset                           0x00000000UL                                         /**< Mode no_reset for RAC_TXRAMP                */
#define _RAC_TXRAMP_TXRESETPAPOWER_reset                              0x00000001UL                                         /**< Mode reset for RAC_TXRAMP                   */
#define RAC_TXRAMP_TXRESETPAPOWER_DEFAULT                             (_RAC_TXRAMP_TXRESETPAPOWER_DEFAULT << 9)            /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXRESETPAPOWER_no_reset                            (_RAC_TXRAMP_TXRESETPAPOWER_no_reset << 9)           /**< Shifted mode no_reset for RAC_TXRAMP        */
#define RAC_TXRAMP_TXRESETPAPOWER_reset                               (_RAC_TXRAMP_TXRESETPAPOWER_reset << 9)              /**< Shifted mode reset for RAC_TXRAMP           */
#define RAC_TXRAMP_TXUNMUTEENDRVFF                                    (0x1UL << 10)                                        /**< TXUNMUTEENDRVFF                             */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_SHIFT                             10                                                   /**< Shift value for RAC_TXUNMUTEENDRVFF         */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_MASK                              0x400UL                                              /**< Bit mask for RAC_TXUNMUTEENDRVFF            */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_DEFAULT                           0x00000000UL                                         /**< Mode DEFAULT for RAC_TXRAMP                 */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_driver_off                        0x00000000UL                                         /**< Mode driver_off for RAC_TXRAMP              */
#define _RAC_TXRAMP_TXUNMUTEENDRVFF_driver_on                         0x00000001UL                                         /**< Mode driver_on for RAC_TXRAMP               */
#define RAC_TXRAMP_TXUNMUTEENDRVFF_DEFAULT                            (_RAC_TXRAMP_TXUNMUTEENDRVFF_DEFAULT << 10)          /**< Shifted mode DEFAULT for RAC_TXRAMP         */
#define RAC_TXRAMP_TXUNMUTEENDRVFF_driver_off                         (_RAC_TXRAMP_TXUNMUTEENDRVFF_driver_off << 10)       /**< Shifted mode driver_off for RAC_TXRAMP      */
#define RAC_TXRAMP_TXUNMUTEENDRVFF_driver_on                          (_RAC_TXRAMP_TXUNMUTEENDRVFF_driver_on << 10)        /**< Shifted mode driver_on for RAC_TXRAMP       */

