SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
/* Bit fields for RAC RFPATHEN1 */
#define _RAC_RFPATHEN1_RESETVALUE                                     0x000000C2UL                                        /**< Default value for RAC_RFPATHEN1             */
#define _RAC_RFPATHEN1_MASK                                           0x000000FFUL                                        /**< Mask for RAC_RFPATHEN1                      */
#define RAC_RFPATHEN1_LNAMIXEN1                                       (0x1UL << 0)                                        /**< LNAMIXEN1                                   */
#define _RAC_RFPATHEN1_LNAMIXEN1_SHIFT                                0                                                   /**< Shift value for RAC_LNAMIXEN1               */
#define _RAC_RFPATHEN1_LNAMIXEN1_MASK                                 0x1UL                                               /**< Bit mask for RAC_LNAMIXEN1                  */
#define _RAC_RFPATHEN1_LNAMIXEN1_DEFAULT                              0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN1_disable                              0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXEN1_enable                               0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_LNAMIXEN1_DEFAULT                               (_RAC_RFPATHEN1_LNAMIXEN1_DEFAULT << 0)             /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN1_disable                               (_RAC_RFPATHEN1_LNAMIXEN1_disable << 0)             /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXEN1_enable                                (_RAC_RFPATHEN1_LNAMIXEN1_enable << 0)              /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1                                (0x1UL << 1)                                        /**< LNAMIXRFATTDCEN1                            */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_SHIFT                         1                                                   /**< Shift value for RAC_LNAMIXRFATTDCEN1        */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_MASK                          0x2UL                                               /**< Bit mask for RAC_LNAMIXRFATTDCEN1           */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT                       0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc                    0x00000000UL                                        /**< Mode disable_dc for RAC_RFPATHEN1           */
#define _RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc                     0x00000001UL                                        /**< Mode enable_dc for RAC_RFPATHEN1            */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT                        (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_DEFAULT << 1)      /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc                     (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_disable_dc << 1)   /**< Shifted mode disable_dc for RAC_RFPATHEN1   */
#define RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc                      (_RAC_RFPATHEN1_LNAMIXRFATTDCEN1_enable_dc << 1)    /**< Shifted mode enable_dc for RAC_RFPATHEN1    */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1                                (0x1UL << 2)                                        /**< LNAMIXRFPKDENRF1                            */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_SHIFT                         2                                                   /**< Shift value for RAC_LNAMIXRFPKDENRF1        */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_MASK                          0x4UL                                               /**< Bit mask for RAC_LNAMIXRFPKDENRF1           */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable                       0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1                  0x00000001UL                                        /**< Mode enable_path1 for RAC_RFPATHEN1         */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT                        (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable                        (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_disable << 2)      /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1                   (_RAC_RFPATHEN1_LNAMIXRFPKDENRF1_enable_path1 << 2) /**< Shifted mode enable_path1 for RAC_RFPATHEN1 */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN                               (0x1UL << 3)                                        /**< SYLODIVRLO1SUBGEN                           */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_SHIFT                        3                                                   /**< Shift value for RAC_SYLODIVRLO1SUBGEN       */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_MASK                         0x8UL                                               /**< Bit mask for RAC_SYLODIVRLO1SUBGEN          */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_DEFAULT                      0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_disable                      0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_enable                       0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_DEFAULT                       (_RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_DEFAULT << 3)     /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_disable                       (_RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_disable << 3)     /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_enable                        (_RAC_RFPATHEN1_SYLODIVRLO1SUBGEN_enable << 3)      /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_TXENHPA1                                        (0x1UL << 4)                                        /**< TXENHPA1                                    */
#define _RAC_RFPATHEN1_TXENHPA1_SHIFT                                 4                                                   /**< Shift value for RAC_TXENHPA1                */
#define _RAC_RFPATHEN1_TXENHPA1_MASK                                  0x10UL                                              /**< Bit mask for RAC_TXENHPA1                   */
#define _RAC_RFPATHEN1_TXENHPA1_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENHPA1_hpa1_off                              0x00000000UL                                        /**< Mode hpa1_off for RAC_RFPATHEN1             */
#define _RAC_RFPATHEN1_TXENHPA1_hpa1_on                               0x00000001UL                                        /**< Mode hpa1_on for RAC_RFPATHEN1              */
#define RAC_RFPATHEN1_TXENHPA1_DEFAULT                                (_RAC_RFPATHEN1_TXENHPA1_DEFAULT << 4)              /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENHPA1_hpa1_off                               (_RAC_RFPATHEN1_TXENHPA1_hpa1_off << 4)             /**< Shifted mode hpa1_off for RAC_RFPATHEN1     */
#define RAC_RFPATHEN1_TXENHPA1_hpa1_on                                (_RAC_RFPATHEN1_TXENHPA1_hpa1_on << 4)              /**< Shifted mode hpa1_on for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENLPA1                                        (0x1UL << 5)                                        /**< TXENLPA1                                    */
#define _RAC_RFPATHEN1_TXENLPA1_SHIFT                                 5                                                   /**< Shift value for RAC_TXENLPA1                */
#define _RAC_RFPATHEN1_TXENLPA1_MASK                                  0x20UL                                              /**< Bit mask for RAC_TXENLPA1                   */
#define _RAC_RFPATHEN1_TXENLPA1_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENLPA1_lpa1_off                              0x00000000UL                                        /**< Mode lpa1_off for RAC_RFPATHEN1             */
#define _RAC_RFPATHEN1_TXENLPA1_lpa1_on                               0x00000001UL                                        /**< Mode lpa1_on for RAC_RFPATHEN1              */
#define RAC_RFPATHEN1_TXENLPA1_DEFAULT                                (_RAC_RFPATHEN1_TXENLPA1_DEFAULT << 5)              /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENLPA1_lpa1_off                               (_RAC_RFPATHEN1_TXENLPA1_lpa1_off << 5)             /**< Shifted mode lpa1_off for RAC_RFPATHEN1     */
#define RAC_RFPATHEN1_TXENLPA1_lpa1_on                                (_RAC_RFPATHEN1_TXENLPA1_lpa1_on << 5)              /**< Shifted mode lpa1_on for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENVMIDHPA1                                    (0x1UL << 6)                                        /**< TXENVMIDHPA1                                */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_SHIFT                             6                                                   /**< Shift value for RAC_TXENVMIDHPA1            */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_MASK                              0x40UL                                              /**< Bit mask for RAC_TXENVMIDHPA1               */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_DEFAULT                           0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_disable                           0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENVMIDHPA1_enable                            0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_TXENVMIDHPA1_DEFAULT                            (_RAC_RFPATHEN1_TXENVMIDHPA1_DEFAULT << 6)          /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENVMIDHPA1_disable                            (_RAC_RFPATHEN1_TXENVMIDHPA1_disable << 6)          /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENVMIDHPA1_enable                             (_RAC_RFPATHEN1_TXENVMIDHPA1_enable << 6)           /**< Shifted mode enable for RAC_RFPATHEN1       */
#define RAC_RFPATHEN1_TXENVMIDLPA1                                    (0x1UL << 7)                                        /**< TXENVMIDLPA1                                */
#define _RAC_RFPATHEN1_TXENVMIDLPA1_SHIFT                             7                                                   /**< Shift value for RAC_TXENVMIDLPA1            */
#define _RAC_RFPATHEN1_TXENVMIDLPA1_MASK                              0x80UL                                              /**< Bit mask for RAC_TXENVMIDLPA1               */
#define _RAC_RFPATHEN1_TXENVMIDLPA1_DEFAULT                           0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENVMIDLPA1_disable                           0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN1              */
#define _RAC_RFPATHEN1_TXENVMIDLPA1_enable                            0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN1               */
#define RAC_RFPATHEN1_TXENVMIDLPA1_DEFAULT                            (_RAC_RFPATHEN1_TXENVMIDLPA1_DEFAULT << 7)          /**< Shifted mode DEFAULT for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENVMIDLPA1_disable                            (_RAC_RFPATHEN1_TXENVMIDLPA1_disable << 7)          /**< Shifted mode disable for RAC_RFPATHEN1      */
#define RAC_RFPATHEN1_TXENVMIDLPA1_enable                             (_RAC_RFPATHEN1_TXENVMIDLPA1_enable << 7)           /**< Shifted mode enable for RAC_RFPATHEN1       */

