SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
#define RAC_TX_SYPFDCHPLPENTX                                         (0x1UL << 17)                                       /**< SYPFDCHPLPENTX                              */
#define _RAC_TX_SYPFDCHPLPENTX_SHIFT                                  17                                                  /**< Shift value for RAC_SYPFDCHPLPENTX          */
#define _RAC_TX_SYPFDCHPLPENTX_MASK                                   0x20000UL                                           /**< Bit mask for RAC_SYPFDCHPLPENTX             */
#define _RAC_TX_SYPFDCHPLPENTX_DEFAULT                                0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYPFDCHPLPENTX_disable                                0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_SYPFDCHPLPENTX_enable                                 0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_SYPFDCHPLPENTX_DEFAULT                                 (_RAC_TX_SYPFDCHPLPENTX_DEFAULT << 17)              /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYPFDCHPLPENTX_disable                                 (_RAC_TX_SYPFDCHPLPENTX_disable << 17)              /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_SYPFDCHPLPENTX_enable                                  (_RAC_TX_SYPFDCHPLPENTX_enable << 17)               /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_SYPFDFPWENTX                                           (0x1UL << 18)                                       /**< SYPFDFPWENTX                                */
#define _RAC_TX_SYPFDFPWENTX_SHIFT                                    18                                                  /**< Shift value for RAC_SYPFDFPWENTX            */
#define _RAC_TX_SYPFDFPWENTX_MASK                                     0x40000UL                                           /**< Bit mask for RAC_SYPFDFPWENTX               */
#define _RAC_TX_SYPFDFPWENTX_DEFAULT                                  0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYPFDFPWENTX_disable                                  0x00000000UL                                        /**< Mode disable for RAC_TX                     */
#define _RAC_TX_SYPFDFPWENTX_enable                                   0x00000001UL                                        /**< Mode enable for RAC_TX                      */
#define RAC_TX_SYPFDFPWENTX_DEFAULT                                   (_RAC_TX_SYPFDFPWENTX_DEFAULT << 18)                /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYPFDFPWENTX_disable                                   (_RAC_TX_SYPFDFPWENTX_disable << 18)                /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_SYPFDFPWENTX_enable                                    (_RAC_TX_SYPFDFPWENTX_enable << 18)                 /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_SYVCOVCAPFASTRAMPTX                                    (0x1UL << 19)                                       /**< SYVCOVCAPFASTRAMPTX                         */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_SHIFT                             19                                                  /**< Shift value for RAC_SYVCOVCAPFASTRAMPTX     */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_MASK                              0x80000UL                                           /**< Bit mask for RAC_SYVCOVCAPFASTRAMPTX        */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_DEFAULT                           0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_0                   0x00000000UL                                        /**< Mode vcap_fastramp_0 for RAC_TX             */
#define _RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_1                   0x00000001UL                                        /**< Mode vcap_fastramp_1 for RAC_TX             */
#define RAC_TX_SYVCOVCAPFASTRAMPTX_DEFAULT                            (_RAC_TX_SYVCOVCAPFASTRAMPTX_DEFAULT << 19)         /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_0                    (_RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_0 << 19) /**< Shifted mode vcap_fastramp_0 for RAC_TX     */
#define RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_1                    (_RAC_TX_SYVCOVCAPFASTRAMPTX_vcap_fastramp_1 << 19) /**< Shifted mode vcap_fastramp_1 for RAC_TX     */
#define RAC_TX_ENPAPOWER                                              (0x1UL << 30)                                       /**< Override                                    */
#define _RAC_TX_ENPAPOWER_SHIFT                                       30                                                  /**< Shift value for RAC_ENPAPOWER               */
#define _RAC_TX_ENPAPOWER_MASK                                        0x40000000UL                                        /**< Bit mask for RAC_ENPAPOWER                  */
#define _RAC_TX_ENPAPOWER_DEFAULT                                     0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPAPOWER_DEFAULT                                      (_RAC_TX_ENPAPOWER_DEFAULT << 30)                   /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_ENPASELSLICE                                           (0x1UL << 31)                                       /**< Override                                    */
#define _RAC_TX_ENPASELSLICE_SHIFT                                    31                                                  /**< Shift value for RAC_ENPASELSLICE            */
#define _RAC_TX_ENPASELSLICE_MASK                                     0x80000000UL                                        /**< Bit mask for RAC_ENPASELSLICE               */
#define _RAC_TX_ENPASELSLICE_DEFAULT                                  0x00000000UL                                        /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPASELSLICE_DEFAULT                                   (_RAC_TX_ENPASELSLICE_DEFAULT << 31)                /**< Shifted mode DEFAULT for RAC_TX             */

