SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
/* Bit fields for RAC SYDIVCTRL */
#define _RAC_SYDIVCTRL_RESETVALUE                                     0x00000000UL                                       /**< Default value for RAC_SYDIVCTRL             */
#define _RAC_SYDIVCTRL_MASK                                           0x00033C00UL                                       /**< Mask for RAC_SYDIVCTRL                      */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_SHIFT                           10                                                 /**< Shift value for RAC_SYLODIVRADCDIV          */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_MASK                            0x3C00UL                                           /**< Bit mask for RAC_SYLODIVRADCDIV             */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_DEFAULT                         0x00000000UL                                       /**< Mode DEFAULT for RAC_SYDIVCTRL              */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_8                     0x00000000UL                                       /**< Mode divide_by_8 for RAC_SYDIVCTRL          */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_9                     0x00000001UL                                       /**< Mode divide_by_9 for RAC_SYDIVCTRL          */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_10                    0x00000002UL                                       /**< Mode divide_by_10 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_11                    0x00000003UL                                       /**< Mode divide_by_11 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_12                    0x00000004UL                                       /**< Mode divide_by_12 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_13                    0x00000005UL                                       /**< Mode divide_by_13 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_14                    0x00000006UL                                       /**< Mode divide_by_14 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_15                    0x00000007UL                                       /**< Mode divide_by_15 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_16                    0x00000008UL                                       /**< Mode divide_by_16 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_17                    0x00000009UL                                       /**< Mode divide_by_17 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_18                    0x0000000AUL                                       /**< Mode divide_by_18 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_19                    0x0000000BUL                                       /**< Mode divide_by_19 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_20                    0x0000000CUL                                       /**< Mode divide_by_20 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_21                    0x0000000DUL                                       /**< Mode divide_by_21 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_22                    0x0000000EUL                                       /**< Mode divide_by_22 for RAC_SYDIVCTRL         */
#define _RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_23                    0x0000000FUL                                       /**< Mode divide_by_23 for RAC_SYDIVCTRL         */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_DEFAULT                          (_RAC_SYDIVCTRL_SYLODIVRADCDIV_DEFAULT << 10)      /**< Shifted mode DEFAULT for RAC_SYDIVCTRL      */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_8                      (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_8 << 10)  /**< Shifted mode divide_by_8 for RAC_SYDIVCTRL  */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_9                      (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_9 << 10)  /**< Shifted mode divide_by_9 for RAC_SYDIVCTRL  */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_10                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_10 << 10) /**< Shifted mode divide_by_10 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_11                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_11 << 10) /**< Shifted mode divide_by_11 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_12                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_12 << 10) /**< Shifted mode divide_by_12 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_13                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_13 << 10) /**< Shifted mode divide_by_13 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_14                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_14 << 10) /**< Shifted mode divide_by_14 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_15                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_15 << 10) /**< Shifted mode divide_by_15 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_16                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_16 << 10) /**< Shifted mode divide_by_16 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_17                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_17 << 10) /**< Shifted mode divide_by_17 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_18                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_18 << 10) /**< Shifted mode divide_by_18 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_19                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_19 << 10) /**< Shifted mode divide_by_19 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_20                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_20 << 10) /**< Shifted mode divide_by_20 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_21                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_21 << 10) /**< Shifted mode divide_by_21 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_22                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_22 << 10) /**< Shifted mode divide_by_22 for RAC_SYDIVCTRL */
#define RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_23                     (_RAC_SYDIVCTRL_SYLODIVRADCDIV_divide_by_23 << 10) /**< Shifted mode divide_by_23 for RAC_SYDIVCTRL */
#define _RAC_SYDIVCTRL_SYLODIVSMUXDIV_SHIFT                           16                                                 /**< Shift value for RAC_SYLODIVSMUXDIV          */
#define _RAC_SYDIVCTRL_SYLODIVSMUXDIV_MASK                            0x30000UL                                          /**< Bit mask for RAC_SYLODIVSMUXDIV             */
#define _RAC_SYDIVCTRL_SYLODIVSMUXDIV_DEFAULT                         0x00000000UL                                       /**< Mode DEFAULT for RAC_SYDIVCTRL              */
#define _RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_1                        0x00000000UL                                       /**< Mode div_by_1 for RAC_SYDIVCTRL             */
#define _RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_2                        0x00000001UL                                       /**< Mode div_by_2 for RAC_SYDIVCTRL             */
#define _RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_4                        0x00000002UL                                       /**< Mode div_by_4 for RAC_SYDIVCTRL             */
#define _RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_8                        0x00000003UL                                       /**< Mode div_by_8 for RAC_SYDIVCTRL             */
#define RAC_SYDIVCTRL_SYLODIVSMUXDIV_DEFAULT                          (_RAC_SYDIVCTRL_SYLODIVSMUXDIV_DEFAULT << 16)      /**< Shifted mode DEFAULT for RAC_SYDIVCTRL      */
#define RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_1                         (_RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_1 << 16)     /**< Shifted mode div_by_1 for RAC_SYDIVCTRL     */
#define RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_2                         (_RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_2 << 16)     /**< Shifted mode div_by_2 for RAC_SYDIVCTRL     */
#define RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_4                         (_RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_4 << 16)     /**< Shifted mode div_by_4 for RAC_SYDIVCTRL     */
#define RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_8                         (_RAC_SYDIVCTRL_SYLODIVSMUXDIV_div_by_8 << 16)     /**< Shifted mode div_by_8 for RAC_SYDIVCTRL     */

