SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
/* Bit fields for RAC AGCOVERWRITE1 */
#define _RAC_AGCOVERWRITE1_RESETVALUE                                 0x00000000UL                                       /**< Default value for RAC_AGCOVERWRITE1         */
#define _RAC_AGCOVERWRITE1_MASK                                       0x3FFF3FFFUL                                       /**< Mask for RAC_AGCOVERWRITE1                  */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_SHIFT                      0                                                  /**< Shift value for RAC_MANLNAMIXRFATT0         */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_MASK                       0x3FFFUL                                           /**< Bit mask for RAC_MANLNAMIXRFATT0            */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_AGCOVERWRITE1          */
#define RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT                     (_RAC_AGCOVERWRITE1_MANLNAMIXRFATT0_DEFAULT << 0)  /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE1  */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_SHIFT                      16                                                 /**< Shift value for RAC_MANLNAMIXRFATT1         */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_MASK                       0x3FFF0000UL                                       /**< Bit mask for RAC_MANLNAMIXRFATT1            */
#define _RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for RAC_AGCOVERWRITE1          */
#define RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT                     (_RAC_AGCOVERWRITE1_MANLNAMIXRFATT1_DEFAULT << 16) /**< Shifted mode DEFAULT for RAC_AGCOVERWRITE1  */

/* Bit fields for RAC IFADCPLLCTRL */
#define _RAC_IFADCPLLCTRL_RESETVALUE                                  0x00000000UL                                      /**< Default value for RAC_IFADCPLLCTRL          */
#define _RAC_IFADCPLLCTRL_MASK                                        0x000001FFUL                                      /**< Mask for RAC_IFADCPLLCTRL                   */
#define _RAC_IFADCPLLCTRL_IFADCPLLINNIBBLE_SHIFT                      0                                                 /**< Shift value for RAC_IFADCPLLINNIBBLE        */
#define _RAC_IFADCPLLCTRL_IFADCPLLINNIBBLE_MASK                       0xFUL                                             /**< Bit mask for RAC_IFADCPLLINNIBBLE           */
#define _RAC_IFADCPLLCTRL_IFADCPLLINNIBBLE_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for RAC_IFADCPLLCTRL           */
#define RAC_IFADCPLLCTRL_IFADCPLLINNIBBLE_DEFAULT                     (_RAC_IFADCPLLCTRL_IFADCPLLINNIBBLE_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_IFADCPLLCTRL   */
#define RAC_IFADCPLLCTRL_IFADCPLLLDCNIB                               (0x1UL << 4)                                      /**< IFADCPLLLDCNIB                              */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_SHIFT                        4                                                 /**< Shift value for RAC_IFADCPLLLDCNIB          */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_MASK                         0x10UL                                            /**< Bit mask for RAC_IFADCPLLLDCNIB             */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_DEFAULT                      0x00000000UL                                      /**< Mode DEFAULT for RAC_IFADCPLLCTRL           */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_disable                      0x00000000UL                                      /**< Mode disable for RAC_IFADCPLLCTRL           */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_enable                       0x00000001UL                                      /**< Mode enable for RAC_IFADCPLLCTRL            */
#define RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_DEFAULT                       (_RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_DEFAULT << 4)   /**< Shifted mode DEFAULT for RAC_IFADCPLLCTRL   */
#define RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_disable                       (_RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_disable << 4)   /**< Shifted mode disable for RAC_IFADCPLLCTRL   */
#define RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_enable                        (_RAC_IFADCPLLCTRL_IFADCPLLLDCNIB_enable << 4)    /**< Shifted mode enable for RAC_IFADCPLLCTRL    */
#define RAC_IFADCPLLCTRL_IFADCPLLLDFNIB                               (0x1UL << 5)                                      /**< IFADCPLLLDFNIB                              */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_SHIFT                        5                                                 /**< Shift value for RAC_IFADCPLLLDFNIB          */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_MASK                         0x20UL                                            /**< Bit mask for RAC_IFADCPLLLDFNIB             */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_DEFAULT                      0x00000000UL                                      /**< Mode DEFAULT for RAC_IFADCPLLCTRL           */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_disable                      0x00000000UL                                      /**< Mode disable for RAC_IFADCPLLCTRL           */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_enable                       0x00000001UL                                      /**< Mode enable for RAC_IFADCPLLCTRL            */
#define RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_DEFAULT                       (_RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_DEFAULT << 5)   /**< Shifted mode DEFAULT for RAC_IFADCPLLCTRL   */
#define RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_disable                       (_RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_disable << 5)   /**< Shifted mode disable for RAC_IFADCPLLCTRL   */
#define RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_enable                        (_RAC_IFADCPLLCTRL_IFADCPLLLDFNIB_enable << 5)    /**< Shifted mode enable for RAC_IFADCPLLCTRL    */
#define RAC_IFADCPLLCTRL_IFADCPLLLDMNIB                               (0x1UL << 6)                                      /**< IFADCPLLLDMNIB                              */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_SHIFT                        6                                                 /**< Shift value for RAC_IFADCPLLLDMNIB          */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_MASK                         0x40UL                                            /**< Bit mask for RAC_IFADCPLLLDMNIB             */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_DEFAULT                      0x00000000UL                                      /**< Mode DEFAULT for RAC_IFADCPLLCTRL           */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_enable                       0x00000000UL                                      /**< Mode enable for RAC_IFADCPLLCTRL            */
#define _RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_disable                      0x00000001UL                                      /**< Mode disable for RAC_IFADCPLLCTRL           */
#define RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_DEFAULT                       (_RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_DEFAULT << 6)   /**< Shifted mode DEFAULT for RAC_IFADCPLLCTRL   */
#define RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_enable                        (_RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_enable << 6)    /**< Shifted mode enable for RAC_IFADCPLLCTRL    */
#define RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_disable                       (_RAC_IFADCPLLCTRL_IFADCPLLLDMNIB_disable << 6)   /**< Shifted mode disable for RAC_IFADCPLLCTRL   */
#define _RAC_IFADCPLLCTRL_IFADCPLLRDNIBBLE_SHIFT                      7                                                 /**< Shift value for RAC_IFADCPLLRDNIBBLE        */
#define _RAC_IFADCPLLCTRL_IFADCPLLRDNIBBLE_MASK                       0x180UL                                           /**< Bit mask for RAC_IFADCPLLRDNIBBLE           */
#define _RAC_IFADCPLLCTRL_IFADCPLLRDNIBBLE_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for RAC_IFADCPLLCTRL           */
#define RAC_IFADCPLLCTRL_IFADCPLLRDNIBBLE_DEFAULT                     (_RAC_IFADCPLLCTRL_IFADCPLLRDNIBBLE_DEFAULT << 7) /**< Shifted mode DEFAULT for RAC_IFADCPLLCTRL   */

