SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32ZG23/Include/efr32zg23_rac.h
/* Bit fields for RAC IFADCPLLREG */
#define _RAC_IFADCPLLREG_RESETVALUE                                   0x00000136UL                                           /**< Default value for RAC_IFADCPLLREG           */
#define _RAC_IFADCPLLREG_MASK                                         0x000001FFUL                                           /**< Mask for RAC_IFADCPLLREG                    */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER                        (0x1UL << 0)                                           /**< IFADCPLLSERIEREGFILTER                      */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_SHIFT                 0                                                      /**< Shift value for RAC_IFADCPLLSERIEREGFILTER  */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_MASK                  0x1UL                                                  /**< Bit mask for RAC_IFADCPLLSERIEREGFILTER     */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_DEFAULT               0x00000000UL                                           /**< Mode DEFAULT for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_disable               0x00000000UL                                           /**< Mode disable for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_enable                0x00000001UL                                           /**< Mode enable for RAC_IFADCPLLREG             */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_DEFAULT                (_RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_disable                (_RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_disable << 0) /**< Shifted mode disable for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_enable                 (_RAC_IFADCPLLREG_IFADCPLLSERIEREGFILTER_enable << 0)  /**< Shifted mode enable for RAC_IFADCPLLREG     */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_SHIFT                  1                                                      /**< Shift value for RAC_IFADCPLLSERIEREGVCTRL   */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_MASK                   0xEUL                                                  /**< Bit mask for RAC_IFADCPLLSERIEREGVCTRL      */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_DEFAULT                0x00000003UL                                           /**< Mode DEFAULT for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p393                 0x00000000UL                                           /**< Mode v1p393 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p370                 0x00000001UL                                           /**< Mode v1p370 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p346                 0x00000002UL                                           /**< Mode v1p346 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p322                 0x00000003UL                                           /**< Mode v1p322 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p298                 0x00000004UL                                           /**< Mode v1p298 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p274                 0x00000005UL                                           /**< Mode v1p274 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p249                 0x00000006UL                                           /**< Mode v1p249 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p225                 0x00000007UL                                           /**< Mode v1p225 for RAC_IFADCPLLREG             */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_DEFAULT                 (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_DEFAULT << 1)  /**< Shifted mode DEFAULT for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p393                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p393 << 1)   /**< Shifted mode v1p393 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p370                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p370 << 1)   /**< Shifted mode v1p370 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p346                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p346 << 1)   /**< Shifted mode v1p346 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p322                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p322 << 1)   /**< Shifted mode v1p322 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p298                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p298 << 1)   /**< Shifted mode v1p298 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p274                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p274 << 1)   /**< Shifted mode v1p274 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p249                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p249 << 1)   /**< Shifted mode v1p249 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p225                  (_RAC_IFADCPLLREG_IFADCPLLSERIEREGVCTRL_v1p225 << 1)   /**< Shifted mode v1p225 for RAC_IFADCPLLREG     */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_SHIFT                  4                                                      /**< Shift value for RAC_IFADCPLLSHUNTREGICTRL   */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_MASK                   0x70UL                                                 /**< Bit mask for RAC_IFADCPLLSHUNTREGICTRL      */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_DEFAULT                0x00000003UL                                           /**< Mode DEFAULT for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur15uA                0x00000000UL                                           /**< Mode cur15uA for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur20uA                0x00000001UL                                           /**< Mode cur20uA for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur25uA                0x00000002UL                                           /**< Mode cur25uA for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur30uA                0x00000003UL                                           /**< Mode cur30uA for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur35uA                0x00000004UL                                           /**< Mode cur35uA for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur40uA                0x00000005UL                                           /**< Mode cur40uA for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur45uA                0x00000006UL                                           /**< Mode cur45uA for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur50uA                0x00000007UL                                           /**< Mode cur50uA for RAC_IFADCPLLREG            */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_DEFAULT                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_DEFAULT << 4)  /**< Shifted mode DEFAULT for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur15uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur15uA << 4)  /**< Shifted mode cur15uA for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur20uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur20uA << 4)  /**< Shifted mode cur20uA for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur25uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur25uA << 4)  /**< Shifted mode cur25uA for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur30uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur30uA << 4)  /**< Shifted mode cur30uA for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur35uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur35uA << 4)  /**< Shifted mode cur35uA for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur40uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur40uA << 4)  /**< Shifted mode cur40uA for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur45uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur45uA << 4)  /**< Shifted mode cur45uA for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur50uA                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGICTRL_cur50uA << 4)  /**< Shifted mode cur50uA for RAC_IFADCPLLREG    */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_SHIFT                  7                                                      /**< Shift value for RAC_IFADCPLLSHUNTREGVCTRL   */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_MASK                   0x180UL                                                /**< Bit mask for RAC_IFADCPLLSHUNTREGVCTRL      */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_DEFAULT                0x00000002UL                                           /**< Mode DEFAULT for RAC_IFADCPLLREG            */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v0p987                 0x00000000UL                                           /**< Mode v0p987 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p027                 0x00000001UL                                           /**< Mode v1p027 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p108                 0x00000002UL                                           /**< Mode v1p108 for RAC_IFADCPLLREG             */
#define _RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p148                 0x00000003UL                                           /**< Mode v1p148 for RAC_IFADCPLLREG             */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_DEFAULT                 (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_DEFAULT << 7)  /**< Shifted mode DEFAULT for RAC_IFADCPLLREG    */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v0p987                  (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v0p987 << 7)   /**< Shifted mode v0p987 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p027                  (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p027 << 7)   /**< Shifted mode v1p027 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p108                  (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p108 << 7)   /**< Shifted mode v1p108 for RAC_IFADCPLLREG     */
#define RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p148                  (_RAC_IFADCPLLREG_IFADCPLLSHUNTREGVCTRL_v1p148 << 7)   /**< Shifted mode v1p148 for RAC_IFADCPLLREG     */

/* Bit fields for RAC IFADCPLLOUTSTATUS */
#define _RAC_IFADCPLLOUTSTATUS_RESETVALUE                             0x00000000UL                                            /**< Default value for RAC_IFADCPLLOUTSTATUS     */
#define _RAC_IFADCPLLOUTSTATUS_MASK                                   0x0000000FUL                                            /**< Mask for RAC_IFADCPLLOUTSTATUS              */
#define _RAC_IFADCPLLOUTSTATUS_IFADCPLLOUTNIBBLE_SHIFT                0                                                       /**< Shift value for RAC_IFADCPLLOUTNIBBLE       */
#define _RAC_IFADCPLLOUTSTATUS_IFADCPLLOUTNIBBLE_MASK                 0xFUL                                                   /**< Bit mask for RAC_IFADCPLLOUTNIBBLE          */
#define _RAC_IFADCPLLOUTSTATUS_IFADCPLLOUTNIBBLE_DEFAULT              0x00000000UL                                            /**< Mode DEFAULT for RAC_IFADCPLLOUTSTATUS      */
#define RAC_IFADCPLLOUTSTATUS_IFADCPLLOUTNIBBLE_DEFAULT               (_RAC_IFADCPLLOUTSTATUS_IFADCPLLOUTNIBBLE_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_IFADCPLLOUTSTATUS*/

